In [1]:
import pandas as pd
import numpy as np
import os 
import re

In [2]:
#Path 2

In [3]:
slug = pd.read_csv('../../dashboard/DFP_slugs.csv')
slug

                      CMS slug ISO-alpha3 Code
0                     zimbabwe             ZWE
1                        libya             LBY
2                new-caledonia             NCL
3                      mayotte             MYT
4                       russia             RUS
..                         ...             ...
245                       guam             GUM
246        trinidad-and-tobago             TTO
247                     tuvalu             TUV
248  wallis-and-futuna-islands             WLF
249                     kosovo             XKK

[250 rows x 2 columns]

In [4]:
countries = pd.read_csv('../../processed/Countries.csv')
countries = countries[['Region Name','Sub-region Name','Country or Area','ISO-alpha3 Code','World Bank Income Level']]
countries

,Region Name,Sub-region Name,Country or Area,ISO-alpha3 Code,World Bank Income Level
0,Africa,Northern Africa,Algeria,DZA,Lower Middle Income
1,Africa,Northern Africa,Egypt,EGY,Lower Middle Income
2,Africa,Northern Africa,Libya,LBY,Upper Middle Income
3,Africa,Northern Africa,Morocco,MAR,Lower Middle Income
4,Africa,Northern Africa,Sudan (the),SDN,Low Income
...,...,...,...,...,...
245,Oceania,Polynesia,Samoa,WSM,Lower Middle Income
246,Oceania,Polynesia,Tokelau,TKL,NaN
247,Oceania,Polynesia,Tonga,TON,Upper Middle Income
248,Oceania,Polynesia,Tuvalu,TUV,Upper Middle Income
249,Oceania,Polynesia,Wallis and Futuna Islands,WLF,NaN

In [5]:
product = pd.merge(slug, countries, how="inner", on=["ISO-alpha3 Code"])
product = product[['CMS slug','Region Name','Sub-region Name','Country or Area','World Bank Income Level']]
product

,CMS slug,Region Name,Sub-region Name,Country or Area,World Bank Income Level
0,zimbabwe,Africa,Sub-Saharan Africa,Zimbabwe,Lower Middle Income
1,libya,Africa,Northern Africa,Libya,Upper Middle Income
2,new-caledonia,Oceania,Melanesia,New Caledonia,High income
3,mayotte,Africa,Sub-Saharan Africa,Mayotte,NaN
4,russia,Europe,Eastern Europe,Russian Federation (the),Upper Middle Income
...,...,...,...,...,...
245,ukraine,Europe,Eastern Europe,Ukraine,Lower Middle Income
246,cook-islands,Oceania,Polynesia,Cook Islands (the),NaN
247,guam,Oceania,Micronesia,Guam,High Income
248,trinidad-and-tobago,Americas,Latin America and the Caribbean,Trinidad and Tobago,High Income
249,kosovo,Europe,Southern Europe,Kosovo (UNSCR 1244),Upper Middle Income

In [6]:
total_score = pd.read_csv('../../score/country_scores/Total_Scores_V2.csv')
total_score.rename(columns={'Country Name':'Country or Area'}, inplace=True)
total_score

     Country or Area     Score       Pillar              Sub-Pillar
0        Afghanistan  4.277583     Business     Startup Environment
1        Afghanistan  1.855000     Business     Technology Adoption
2        Afghanistan  3.066292     Business                     NaN
3        Afghanistan  1.600000  Foundations           Data Exchange
4        Afghanistan  3.650000  Foundations  Digital Legal Identity
...              ...       ...          ...                     ...
4343        Zimbabwe  3.300000   Regulation           Cybersecurity
4344        Zimbabwe  2.950000   Regulation       Ethical Standards
4345        Zimbabwe  3.125000   Regulation                     NaN
4346        Zimbabwe  3.935000     Strategy                Ambition
4347        Zimbabwe  2.783166          NaN                     NaN

[4348 rows x 4 columns]

In [7]:
flourish = pd.merge(product, total_score, how="inner", on=["Country or Area"])
flourish.sort_values(by=['Country or Area','Pillar','Sub-Pillar'], inplace=True)

In [8]:
flourish.to_csv('../country_scores/Flourish Data.csv',index = False)